# GetBackgroundSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingSettings..::..GetBackgroundSettings Method
RenderingSettings Class See Also
---
Returns an object that represents the rendering background settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public BackgroundSettings GetBackgroundSettings()
```

Visual Basic
---
```text
Public Function GetBackgroundSettings As BackgroundSettings
```

Visual C++
---
```text
public:
BackgroundSettings^ GetBackgroundSettings()
```

# ### Return Value
The rendering background settings.
# Remarks
Different kind of settings object will be returned according to different background style. It could be SkyBackgroundSettings, ColorBackgroundSettings, or ImageBackgroundSettings.
# See Also
RenderingSettings Class
Autodesk.Revit.DB Namespace